app/views/posts/index.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
      <div class="post_metadata">
        <%= link_to post.user.first_name, posts_path(:user_id => post.user.id) %>