app/controllers/posts_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `posts`.* FROM `posts`
---
  def index
    if params[:user_id].present?
      @posts = User.find(params[:user_id]).posts
    else
      @posts = Post.all